7767517
192 207
Input            input.1                  0 1 input.1
Convolution      361                      1 1 input.1 361 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        362                      1 1 361 362 0=32
Clip             363                      1 1 362 363 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 364                      1 1 363 364 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        365                      1 1 364 365 0=32
Clip             366                      1 1 365 366 0=0.000000e+00 1=6.000000e+00
Convolution      367                      1 1 366 367 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        368                      1 1 367 368 0=16
Convolution      369                      1 1 368 369 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        370                      1 1 369 370 0=96
Clip             371                      1 1 370 371 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 372                      1 1 371 372 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        373                      1 1 372 373 0=96
Clip             374                      1 1 373 374 0=0.000000e+00 1=6.000000e+00
Convolution      375                      1 1 374 375 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        376                      1 1 375 376 0=24
Split            splitncnn_0              1 2 376 376_splitncnn_0 376_splitncnn_1
Convolution      377                      1 1 376_splitncnn_1 377 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        378                      1 1 377 378 0=144
Clip             379                      1 1 378 379 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 380                      1 1 379 380 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        381                      1 1 380 381 0=144
Clip             382                      1 1 381 382 0=0.000000e+00 1=6.000000e+00
Convolution      383                      1 1 382 383 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        384                      1 1 383 384 0=24
BinaryOp         385                      2 1 376_splitncnn_0 384 385 0=0
Split            splitncnn_1              1 2 385 385_splitncnn_0 385_splitncnn_1
Convolution      386                      1 1 385_splitncnn_1 386 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        387                      1 1 386 387 0=144
Clip             388                      1 1 387 388 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 389                      1 1 388 389 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        390                      1 1 389 390 0=144
Clip             391                      1 1 390 391 0=0.000000e+00 1=6.000000e+00
Convolution      392                      1 1 391 392 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        393                      1 1 392 393 0=32
Split            splitncnn_2              1 2 393 393_splitncnn_0 393_splitncnn_1
Convolution      394                      1 1 393_splitncnn_1 394 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        395                      1 1 394 395 0=192
Clip             396                      1 1 395 396 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 397                      1 1 396 397 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        398                      1 1 397 398 0=192
Clip             399                      1 1 398 399 0=0.000000e+00 1=6.000000e+00
Convolution      400                      1 1 399 400 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        401                      1 1 400 401 0=32
BinaryOp         402                      2 1 393_splitncnn_0 401 402 0=0
Split            splitncnn_3              1 2 402 402_splitncnn_0 402_splitncnn_1
Convolution      403                      1 1 402_splitncnn_1 403 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        404                      1 1 403 404 0=192
Clip             405                      1 1 404 405 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 406                      1 1 405 406 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        407                      1 1 406 407 0=192
Clip             408                      1 1 407 408 0=0.000000e+00 1=6.000000e+00
Convolution      409                      1 1 408 409 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        410                      1 1 409 410 0=32
BinaryOp         411                      2 1 402_splitncnn_0 410 411 0=0
Split            splitncnn_4              1 2 411 411_splitncnn_0 411_splitncnn_1
Convolution      412                      1 1 411_splitncnn_1 412 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        413                      1 1 412 413 0=192
Clip             414                      1 1 413 414 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 415                      1 1 414 415 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        416                      1 1 415 416 0=192
Clip             417                      1 1 416 417 0=0.000000e+00 1=6.000000e+00
Convolution      418                      1 1 417 418 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        419                      1 1 418 419 0=64
Split            splitncnn_5              1 2 419 419_splitncnn_0 419_splitncnn_1
Convolution      420                      1 1 419_splitncnn_1 420 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        421                      1 1 420 421 0=384
Clip             422                      1 1 421 422 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 423                      1 1 422 423 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        424                      1 1 423 424 0=384
Clip             425                      1 1 424 425 0=0.000000e+00 1=6.000000e+00
Convolution      426                      1 1 425 426 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        427                      1 1 426 427 0=64
BinaryOp         428                      2 1 419_splitncnn_0 427 428 0=0
Split            splitncnn_6              1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution      429                      1 1 428_splitncnn_1 429 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        430                      1 1 429 430 0=384
Clip             431                      1 1 430 431 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 432                      1 1 431 432 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        433                      1 1 432 433 0=384
Clip             434                      1 1 433 434 0=0.000000e+00 1=6.000000e+00
Convolution      435                      1 1 434 435 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        436                      1 1 435 436 0=64
BinaryOp         437                      2 1 428_splitncnn_0 436 437 0=0
Split            splitncnn_7              1 2 437 437_splitncnn_0 437_splitncnn_1
Convolution      438                      1 1 437_splitncnn_1 438 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        439                      1 1 438 439 0=384
Clip             440                      1 1 439 440 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 441                      1 1 440 441 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        442                      1 1 441 442 0=384
Clip             443                      1 1 442 443 0=0.000000e+00 1=6.000000e+00
Convolution      444                      1 1 443 444 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        445                      1 1 444 445 0=64
BinaryOp         446                      2 1 437_splitncnn_0 445 446 0=0
Convolution      447                      1 1 446 447 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        448                      1 1 447 448 0=384
Clip             449                      1 1 448 449 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 450                      1 1 449 450 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        451                      1 1 450 451 0=384
Clip             452                      1 1 451 452 0=0.000000e+00 1=6.000000e+00
Convolution      453                      1 1 452 453 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        454                      1 1 453 454 0=96
Split            splitncnn_8              1 2 454 454_splitncnn_0 454_splitncnn_1
Convolution      455                      1 1 454_splitncnn_1 455 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        456                      1 1 455 456 0=576
Clip             457                      1 1 456 457 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 458                      1 1 457 458 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        459                      1 1 458 459 0=576
Clip             460                      1 1 459 460 0=0.000000e+00 1=6.000000e+00
Convolution      461                      1 1 460 461 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        462                      1 1 461 462 0=96
BinaryOp         463                      2 1 454_splitncnn_0 462 463 0=0
Split            splitncnn_9              1 2 463 463_splitncnn_0 463_splitncnn_1
Convolution      464                      1 1 463_splitncnn_1 464 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        465                      1 1 464 465 0=576
Clip             466                      1 1 465 466 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 467                      1 1 466 467 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        468                      1 1 467 468 0=576
Clip             469                      1 1 468 469 0=0.000000e+00 1=6.000000e+00
Convolution      470                      1 1 469 470 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        471                      1 1 470 471 0=96
BinaryOp         472                      2 1 463_splitncnn_0 471 472 0=0
Split            splitncnn_10             1 2 472 472_splitncnn_0 472_splitncnn_1
Convolution      473                      1 1 472_splitncnn_1 473 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        474                      1 1 473 474 0=576
Clip             475                      1 1 474 475 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 476                      1 1 475 476 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        477                      1 1 476 477 0=576
Clip             478                      1 1 477 478 0=0.000000e+00 1=6.000000e+00
Convolution      479                      1 1 478 479 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        480                      1 1 479 480 0=160
Split            splitncnn_11             1 2 480 480_splitncnn_0 480_splitncnn_1
Convolution      481                      1 1 480_splitncnn_1 481 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        482                      1 1 481 482 0=960
Clip             483                      1 1 482 483 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 484                      1 1 483 484 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        485                      1 1 484 485 0=960
Clip             486                      1 1 485 486 0=0.000000e+00 1=6.000000e+00
Convolution      487                      1 1 486 487 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        488                      1 1 487 488 0=160
BinaryOp         489                      2 1 480_splitncnn_0 488 489 0=0
Split            splitncnn_12             1 2 489 489_splitncnn_0 489_splitncnn_1
Convolution      490                      1 1 489_splitncnn_1 490 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        491                      1 1 490 491 0=960
Clip             492                      1 1 491 492 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 493                      1 1 492 493 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        494                      1 1 493 494 0=960
Clip             495                      1 1 494 495 0=0.000000e+00 1=6.000000e+00
Convolution      496                      1 1 495 496 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        497                      1 1 496 497 0=160
BinaryOp         498                      2 1 489_splitncnn_0 497 498 0=0
Convolution      499                      1 1 498 499 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        500                      1 1 499 500 0=960
Clip             501                      1 1 500 501 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 502                      1 1 501 502 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        503                      1 1 502 503 0=960
Clip             504                      1 1 503 504 0=0.000000e+00 1=6.000000e+00
Convolution      505                      1 1 504 505 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        506                      1 1 505 506 0=320
Convolution      507                      1 1 506 507 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=7680
BatchNorm        508                      1 1 507 508 0=24
ReLU             509                      1 1 508 509
DeconvolutionDepthWise 510                      1 1 509 510 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        511                      1 1 510 511 0=24
ReLU             512                      1 1 511 512
Convolution      513                      1 1 472_splitncnn_0 513 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        514                      1 1 513 514 0=24
ReLU             515                      1 1 514 515
BinaryOp         516                      2 1 512 515 516 0=0
DeconvolutionDepthWise 517                      1 1 516 517 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        518                      1 1 517 518 0=24
ReLU             519                      1 1 518 519
Convolution      520                      1 1 411_splitncnn_0 520 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=768
BatchNorm        521                      1 1 520 521 0=24
ReLU             522                      1 1 521 522
BinaryOp         523                      2 1 519 522 523 0=0
DeconvolutionDepthWise 524                      1 1 523 524 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        525                      1 1 524 525 0=24
ReLU             526                      1 1 525 526
Convolution      527                      1 1 385_splitncnn_0 527 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        528                      1 1 527 528 0=24
ReLU             529                      1 1 528 529
BinaryOp         530                      2 1 526 529 530 0=0
Convolution      531                      1 1 530 531 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184
BatchNorm        532                      1 1 531 532 0=24
ReLU             533                      1 1 532 533
Split            splitncnn_13             1 3 533 533_splitncnn_0 533_splitncnn_1 533_splitncnn_2
Convolution      534                      1 1 533_splitncnn_2 534 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24
Sigmoid          535                      1 1 534 535
Convolution      536                      1 1 533_splitncnn_1 536 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
Convolution      537                      1 1 533_splitncnn_0 537 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
