7767517
95 105
Input            input                    0 1 input
Convolution      151                      1 1 input 151 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=0 6=9408
BatchNorm        152                      1 1 151 152 0=64
ReLU             153                      1 1 152 153
Pooling          154                      1 1 153 154 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 154 154_splitncnn_0 154_splitncnn_1
Convolution      155                      1 1 154_splitncnn_1 155 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        156                      1 1 155 156 0=64
ReLU             157                      1 1 156 157
Convolution      158                      1 1 157 158 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        159                      1 1 158 159 0=64
BinaryOp         160                      2 1 159 154_splitncnn_0 160 0=0
ReLU             161                      1 1 160 161
Split            splitncnn_1              1 2 161 161_splitncnn_0 161_splitncnn_1
Convolution      162                      1 1 161_splitncnn_1 162 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        163                      1 1 162 163 0=64
ReLU             164                      1 1 163 164
Convolution      165                      1 1 164 165 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        166                      1 1 165 166 0=64
BinaryOp         167                      2 1 166 161_splitncnn_0 167 0=0
ReLU             168                      1 1 167 168
Split            splitncnn_2              1 2 168 168_splitncnn_0 168_splitncnn_1
Convolution      169                      1 1 168_splitncnn_1 169 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=73728
BatchNorm        170                      1 1 169 170 0=128
ReLU             171                      1 1 170 171
Convolution      172                      1 1 171 172 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        173                      1 1 172 173 0=128
Convolution      174                      1 1 168_splitncnn_0 174 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        175                      1 1 174 175 0=128
BinaryOp         176                      2 1 173 175 176 0=0
ReLU             177                      1 1 176 177
Split            splitncnn_3              1 2 177 177_splitncnn_0 177_splitncnn_1
Convolution      178                      1 1 177_splitncnn_1 178 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        179                      1 1 178 179 0=128
ReLU             180                      1 1 179 180
Convolution      181                      1 1 180 181 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=147456
BatchNorm        182                      1 1 181 182 0=128
BinaryOp         183                      2 1 182 177_splitncnn_0 183 0=0
ReLU             184                      1 1 183 184
Split            splitncnn_4              1 2 184 184_splitncnn_0 184_splitncnn_1
Convolution      185                      1 1 184_splitncnn_1 185 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=294912
BatchNorm        186                      1 1 185 186 0=256
ReLU             187                      1 1 186 187
Convolution      188                      1 1 187 188 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        189                      1 1 188 189 0=256
Convolution      190                      1 1 184_splitncnn_0 190 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        191                      1 1 190 191 0=256
BinaryOp         192                      2 1 189 191 192 0=0
ReLU             193                      1 1 192 193
Split            splitncnn_5              1 2 193 193_splitncnn_0 193_splitncnn_1
Convolution      194                      1 1 193_splitncnn_1 194 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        195                      1 1 194 195 0=256
ReLU             196                      1 1 195 196
Convolution      197                      1 1 196 197 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=589824
BatchNorm        198                      1 1 197 198 0=256
BinaryOp         199                      2 1 198 193_splitncnn_0 199 0=0
ReLU             200                      1 1 199 200
Split            splitncnn_6              1 2 200 200_splitncnn_0 200_splitncnn_1
Convolution      201                      1 1 200_splitncnn_1 201 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1179648
BatchNorm        202                      1 1 201 202 0=512
ReLU             203                      1 1 202 203
Convolution      204                      1 1 203 204 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        205                      1 1 204 205 0=512
Convolution      206                      1 1 200_splitncnn_0 206 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=131072
BatchNorm        207                      1 1 206 207 0=512
BinaryOp         208                      2 1 205 207 208 0=0
ReLU             209                      1 1 208 209
Split            splitncnn_7              1 2 209 209_splitncnn_0 209_splitncnn_1
Convolution      210                      1 1 209_splitncnn_1 210 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        211                      1 1 210 211 0=512
ReLU             212                      1 1 211 212
Convolution      213                      1 1 212 213 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2359296
BatchNorm        214                      1 1 213 214 0=512
BinaryOp         215                      2 1 214 209_splitncnn_0 215 0=0
ReLU             216                      1 1 215 216
Deconvolution    217                      1 1 216 217 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2097152
BatchNorm        218                      1 1 217 218 0=256
ReLU             219                      1 1 218 219
Deconvolution    220                      1 1 219 220 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1048576
BatchNorm        221                      1 1 220 221 0=256
ReLU             222                      1 1 221 222
Deconvolution    223                      1 1 222 223 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1048576
BatchNorm        224                      1 1 223 224 0=256
ReLU             225                      1 1 224 225
Split            splitncnn_8              1 3 225 225_splitncnn_0 225_splitncnn_1 225_splitncnn_2
Convolution      226                      1 1 225_splitncnn_2 226 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             227                      1 1 226 227
Convolution      228                      1 1 227 228 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Sigmoid          hm                       1 1 228 hm
Convolution      230                      1 1 225_splitncnn_1 230 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             231                      1 1 230 231
Convolution      wh                       1 1 231 wh 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      233                      1 1 225_splitncnn_0 233 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             234                      1 1 233 234
Convolution      reg                      1 1 234 reg 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
