7767517
197 212
Input            input.1                  0 1 input.1
Convolution      367                      1 1 input.1 367 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        368                      1 1 367 368 0=32
ReLU             369                      1 1 368 369
ConvolutionDepthWise 370                      1 1 369 370 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        371                      1 1 370 371 0=32
ReLU             372                      1 1 371 372
Convolution      373                      1 1 372 373 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        374                      1 1 373 374 0=16
Convolution      375                      1 1 374 375 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        376                      1 1 375 376 0=96
ReLU             377                      1 1 376 377
ConvolutionDepthWise 378                      1 1 377 378 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        379                      1 1 378 379 0=96
ReLU             380                      1 1 379 380
Convolution      381                      1 1 380 381 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        382                      1 1 381 382 0=24
Split            splitncnn_0              1 2 382 382_splitncnn_0 382_splitncnn_1
Convolution      383                      1 1 382_splitncnn_1 383 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        384                      1 1 383 384 0=144
ReLU             385                      1 1 384 385
ConvolutionDepthWise 386                      1 1 385 386 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        387                      1 1 386 387 0=144
ReLU             388                      1 1 387 388
Convolution      389                      1 1 388 389 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        390                      1 1 389 390 0=24
BinaryOp         391                      2 1 382_splitncnn_0 390 391 0=0
Split            splitncnn_1              1 2 391 391_splitncnn_0 391_splitncnn_1
Convolution      392                      1 1 391_splitncnn_1 392 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        393                      1 1 392 393 0=144
ReLU             394                      1 1 393 394
ConvolutionDepthWise 395                      1 1 394 395 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        396                      1 1 395 396 0=144
ReLU             397                      1 1 396 397
Convolution      398                      1 1 397 398 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        399                      1 1 398 399 0=32
Split            splitncnn_2              1 2 399 399_splitncnn_0 399_splitncnn_1
Convolution      400                      1 1 399_splitncnn_1 400 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        401                      1 1 400 401 0=192
ReLU             402                      1 1 401 402
ConvolutionDepthWise 403                      1 1 402 403 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        404                      1 1 403 404 0=192
ReLU             405                      1 1 404 405
Convolution      406                      1 1 405 406 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        407                      1 1 406 407 0=32
BinaryOp         408                      2 1 399_splitncnn_0 407 408 0=0
Split            splitncnn_3              1 2 408 408_splitncnn_0 408_splitncnn_1
Convolution      409                      1 1 408_splitncnn_1 409 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        410                      1 1 409 410 0=192
ReLU             411                      1 1 410 411
ConvolutionDepthWise 412                      1 1 411 412 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        413                      1 1 412 413 0=192
ReLU             414                      1 1 413 414
Convolution      415                      1 1 414 415 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        416                      1 1 415 416 0=32
BinaryOp         417                      2 1 408_splitncnn_0 416 417 0=0
Split            splitncnn_4              1 2 417 417_splitncnn_0 417_splitncnn_1
Convolution      418                      1 1 417_splitncnn_1 418 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        419                      1 1 418 419 0=192
ReLU             420                      1 1 419 420
ConvolutionDepthWise 421                      1 1 420 421 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        422                      1 1 421 422 0=192
ReLU             423                      1 1 422 423
Convolution      424                      1 1 423 424 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        425                      1 1 424 425 0=64
Split            splitncnn_5              1 2 425 425_splitncnn_0 425_splitncnn_1
Convolution      426                      1 1 425_splitncnn_1 426 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        427                      1 1 426 427 0=384
ReLU             428                      1 1 427 428
ConvolutionDepthWise 429                      1 1 428 429 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        430                      1 1 429 430 0=384
ReLU             431                      1 1 430 431
Convolution      432                      1 1 431 432 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        433                      1 1 432 433 0=64
BinaryOp         434                      2 1 425_splitncnn_0 433 434 0=0
Split            splitncnn_6              1 2 434 434_splitncnn_0 434_splitncnn_1
Convolution      435                      1 1 434_splitncnn_1 435 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        436                      1 1 435 436 0=384
ReLU             437                      1 1 436 437
ConvolutionDepthWise 438                      1 1 437 438 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        439                      1 1 438 439 0=384
ReLU             440                      1 1 439 440
Convolution      441                      1 1 440 441 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        442                      1 1 441 442 0=64
BinaryOp         443                      2 1 434_splitncnn_0 442 443 0=0
Split            splitncnn_7              1 2 443 443_splitncnn_0 443_splitncnn_1
Convolution      444                      1 1 443_splitncnn_1 444 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        445                      1 1 444 445 0=384
ReLU             446                      1 1 445 446
ConvolutionDepthWise 447                      1 1 446 447 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        448                      1 1 447 448 0=384
ReLU             449                      1 1 448 449
Convolution      450                      1 1 449 450 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        451                      1 1 450 451 0=64
BinaryOp         452                      2 1 443_splitncnn_0 451 452 0=0
Convolution      453                      1 1 452 453 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        454                      1 1 453 454 0=384
ReLU             455                      1 1 454 455
ConvolutionDepthWise 456                      1 1 455 456 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        457                      1 1 456 457 0=384
ReLU             458                      1 1 457 458
Convolution      459                      1 1 458 459 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        460                      1 1 459 460 0=96
Split            splitncnn_8              1 2 460 460_splitncnn_0 460_splitncnn_1
Convolution      461                      1 1 460_splitncnn_1 461 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        462                      1 1 461 462 0=576
ReLU             463                      1 1 462 463
ConvolutionDepthWise 464                      1 1 463 464 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        465                      1 1 464 465 0=576
ReLU             466                      1 1 465 466
Convolution      467                      1 1 466 467 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        468                      1 1 467 468 0=96
BinaryOp         469                      2 1 460_splitncnn_0 468 469 0=0
Split            splitncnn_9              1 2 469 469_splitncnn_0 469_splitncnn_1
Convolution      470                      1 1 469_splitncnn_1 470 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        471                      1 1 470 471 0=576
ReLU             472                      1 1 471 472
ConvolutionDepthWise 473                      1 1 472 473 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        474                      1 1 473 474 0=576
ReLU             475                      1 1 474 475
Convolution      476                      1 1 475 476 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        477                      1 1 476 477 0=96
BinaryOp         478                      2 1 469_splitncnn_0 477 478 0=0
Split            splitncnn_10             1 2 478 478_splitncnn_0 478_splitncnn_1
Convolution      479                      1 1 478_splitncnn_1 479 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        480                      1 1 479 480 0=576
ReLU             481                      1 1 480 481
ConvolutionDepthWise 482                      1 1 481 482 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        483                      1 1 482 483 0=576
ReLU             484                      1 1 483 484
Convolution      485                      1 1 484 485 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        486                      1 1 485 486 0=160
Split            splitncnn_11             1 2 486 486_splitncnn_0 486_splitncnn_1
Convolution      487                      1 1 486_splitncnn_1 487 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        488                      1 1 487 488 0=960
ReLU             489                      1 1 488 489
ConvolutionDepthWise 490                      1 1 489 490 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        491                      1 1 490 491 0=960
ReLU             492                      1 1 491 492
Convolution      493                      1 1 492 493 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        494                      1 1 493 494 0=160
BinaryOp         495                      2 1 486_splitncnn_0 494 495 0=0
Split            splitncnn_12             1 2 495 495_splitncnn_0 495_splitncnn_1
Convolution      496                      1 1 495_splitncnn_1 496 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        497                      1 1 496 497 0=960
ReLU             498                      1 1 497 498
ConvolutionDepthWise 499                      1 1 498 499 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        500                      1 1 499 500 0=960
ReLU             501                      1 1 500 501
Convolution      502                      1 1 501 502 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        503                      1 1 502 503 0=160
BinaryOp         504                      2 1 495_splitncnn_0 503 504 0=0
Convolution      505                      1 1 504 505 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        506                      1 1 505 506 0=960
ReLU             507                      1 1 506 507
ConvolutionDepthWise 508                      1 1 507 508 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        509                      1 1 508 509 0=960
ReLU             510                      1 1 509 510
Convolution      511                      1 1 510 511 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        512                      1 1 511 512 0=320
Convolution      513                      1 1 512 513 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=7680
BatchNorm        514                      1 1 513 514 0=24
ReLU             515                      1 1 514 515
DeconvolutionDepthWise 516                      1 1 515 516 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        517                      1 1 516 517 0=24
ReLU             518                      1 1 517 518
Convolution      519                      1 1 478_splitncnn_0 519 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        520                      1 1 519 520 0=24
ReLU             521                      1 1 520 521
BinaryOp         522                      2 1 518 521 522 0=0
DeconvolutionDepthWise 523                      1 1 522 523 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        524                      1 1 523 524 0=24
ReLU             525                      1 1 524 525
Convolution      526                      1 1 417_splitncnn_0 526 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=768
BatchNorm        527                      1 1 526 527 0=24
ReLU             528                      1 1 527 528
BinaryOp         529                      2 1 525 528 529 0=0
DeconvolutionDepthWise 530                      1 1 529 530 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=96 7=24
BatchNorm        531                      1 1 530 531 0=24
ReLU             532                      1 1 531 532
Convolution      533                      1 1 391_splitncnn_0 533 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        534                      1 1 533 534 0=24
ReLU             535                      1 1 534 535
BinaryOp         536                      2 1 532 535 536 0=0
Convolution      537                      1 1 536 537 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184
BatchNorm        538                      1 1 537 538 0=24
ReLU             539                      1 1 538 539
Split            splitncnn_13             1 3 539 539_splitncnn_0 539_splitncnn_1 539_splitncnn_2
Convolution      540                      1 1 539_splitncnn_2 540 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             541                      1 1 540 541
Convolution      542                      1 1 541 542 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
Convolution      543                      1 1 539_splitncnn_1 543 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             544                      1 1 543 544
Convolution      545                      1 1 544 545 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
Convolution      546                      1 1 539_splitncnn_0 546 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             547                      1 1 546 547
Convolution      548                      1 1 547 548 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=48
